//
//  Localizable.strings
//  Stats
//
//  Created by Eduardo Santos on 26/02/2023.
//  Using Swift 5.0.
//  Running on macOS 11.1.
//
//  Copyright © 2020 Rafael Fernandes. All rights reserved.
//

// Modules
"CPU" = "CPU";
"Open CPU settings" = "Abrir definições da CPU";
"GPU" = "GPU";
"Open GPU settings" = "Abrir definições da GPU";
"RAM" = "RAM";
"Open RAM settings" = "Abrir definições da RAM";
"Disk" = "Disco"; // translategemma:4b
"Open Disk settings" = "Abrir definições do disco";
"Sensors" = "Sensores"; // translategemma:4b
"Open Sensors settings" = "Abrir definições dos sensores";
"Network" = "Rede"; // translategemma:4b
"Open Network settings" = "Abrir definições da rede";
"Battery" = "Bateria"; // translategemma:4b
"Open Battery settings" = "Abrir definições da bateria";
"Bluetooth" = "Bluetooth";
"Open Bluetooth settings" = "Abrir definições do bluetooth";
"Clock" = "Relógio"; // translategemma:4b
"Open Clock settings" = "Abrir configurações do relógio"; // translategemma:4b

// Words
"Unknown" = "Desconhecido";
"Version" = "Versão";
"Processor" = "Processador";
"Memory" = "Memória";
"Graphics" = "Gráficos";
"Close" = "Fechar";
"Download" = "Fazer download";
"Install" = "Instalar";
"Cancel" = "Cancelar";
"Unavailable" = "Indisponível";
"Yes" = "Sim";
"No" = "Não";
"Automatic" = "Automático";
"Manual" = "Manual";
"None" = "Nenhum";
"Dots" = "Pontos";
"Arrows" = "Setas";
"Characters" = "Letras";
"Short" = "Curto";
"Long" = "Longo";
"Statistics" = "Estatísticas";
"Max" = "Máximo"; // translategemma:4b
"Min" = "Meu"; // translategemma:4b
"Reset" = "Restabelecer";
"Alignment" = "Alinhamento";
"Left alignment" = "Alinhamento à esq.";
"Center alignment" = "Alinhamento ao centro";
"Right alignment" = "Alinhamento à dir.";
"Dashboard" = "Painel";
"Enabled" = "Ativado";
"Disabled" = "Desativado";
"Silent" = "Silencioso";
"Units" = "Unidades";
"Fans" = "Ventoinhas";
"Scaling" = "Dimensionamento";
"Linear" = "Linear";
"Square" = "Quadrado";
"Cube" = "Cubo";
"Logarithmic" = "Logarítmico";
"Fixed scale" = "Corrigido"; // translategemma:4b
"Cores" = "Cores";
"Settings" = "Definições";
"Name" = "Nome"; // translategemma:4b
"Format" = "Formato"; // translategemma:4b
"Turn off" = "Desligar"; // translategemma:4b
"Normal" = "Normal";
"Warning" = "Aviso"; // translategemma:4b
"Critical" = "Crucial"; // translategemma:4b
"Usage" = "Utilização"; // translategemma:4b
"2 minutes" = "2 minutos"; // translategemma:4b
"3 minutes" = "3 minutos"; // translategemma:4b
"10 minutes" = "10 minutos"; // translategemma:4b
"Import" = "Importação"; // translategemma:4b
"Export" = "Exportar"; // translategemma:4b
"Separator" = "Separador"; // translategemma:4b
"Read" = "Leia"; // translategemma:4b
"Write" = "Escreva"; // translategemma:4b
"Frequency" = "Frequência"; // translategemma:4b
"Save" = "Salvar"; // translategemma:4b
"Run" = "Executar"; // translategemma:4b
"Stop" = "Pare"; // translategemma:4b
"Uninstall" = "Desinstalar"; // translategemma:4b
"1 sec" = "1 segundo"; // translategemma:4b
"2 sec" = "2 segundos"; // translategemma:4b
"3 sec" = "3 segundos"; // translategemma:4b
"5 sec" = "5 segundos"; // translategemma:4b
"10 sec" = "10 segundos"; // translategemma:4b
"15 sec" = "15 segundos"; // translategemma:4b
"30 sec" = "30 segundos"; // translategemma:4b
"60 sec" = "60 segundos"; // translategemma:4b

// Setup
"Stats Setup" = "Configurações do Stats";
"Previous" = "Anterior";
"Previous page" = "Página anterior";
"Next" = "Próximo";
"Next page" = "Próxima página";
"Finish" = "Terminar";
"Finish setup" = "Terminar a configuração";
"Welcome to Stats" = "Bem-vindo ao Stats";
"welcome_message" = "Obrigado por usar o Stats, um monitor de sistema macOS open source grátis para a tua barra de menus.";
"Start the application automatically when starting your Mac" = "Iniciar a aplicação automaticamente ao iniciar o teu Mac";
"Do not start the application automatically when starting your Mac" = "Não iniciar a aplicação automaticamente ao iniciar o teu Mac";
"Do everything silently in the background (recommended)" = "Fazer tudo silenciosamente em segundo plano (recomendado)";
"Check for a new version on startup" = "Verficar se há novas atualizações ao iniciar";
"Check for a new version every day (once a day)" = "Verficar se há novas atualizações uma vez por dia (uma vez por dia)";
"Check for a new version every week (once a week)" = "Verficar se há novas atualizações uma vez por semana (uma vez por semana)";
"Check for a new version every month (once a month)" = "Verficar se há novas atualizações uma vez por mês (uma vez por mês)";
"Never check for updates (not recommended)" = "Nunca verificar se há novas atualizações (não recomendado)";
"Anonymous telemetry for better development decisions" = "Telemetria anónima para melhores decisões de desenvolvimento"; // translategemma:4b
"Share anonymous telemetry data" = "Partilhar dados de telemetria anónimos"; // translategemma:4b
"Do not share anonymous telemetry data" = "Não partilhe dados de telemetria anónimos"; // translategemma:4b
"The configuration is completed" = "A configuração está completa";
"finish_setup_message" = "Está tudo configurado! \n O Stats é uma ferramenta de código aberto, é gratuito e sempre será. \n Se gostas, podes apoiar o projeto, és sempre bem-vindo!";

// Alerts
"New version available" = "Nova versão disponível";
"Click to install the new version of Stats" = "Clique para instalar a nova versão do Stats";
"Successfully updated" = "Atualização feita com sucesso";
"Stats was updated to v" = "Stats foi atualizado para v%0";
"Reset settings text" = "Todas as configurações da aplicação serão restabelecidas e a aplicação será reiniciada. Tens a certeza que queres fazer isso?";
"Support text" = "Obrigado por utilizar o Stats!\n\nA manutenção e melhoria deste projeto de código aberto requer tempo e recursos. O seu apoio ajuda-nos a continuar a fornecer uma aplicação gratuita e fiável para todos.\n\nSe considera o Stats útil, por favor considere fazer uma contribuição. Cada pedacinho ajuda!";

// Settings
"Open Activity Monitor" = "Abrir Monitor de Atividades";
"Report a bug" = "Reportar um erro";
"Support the application" = "Apoia a aplicação";
"Close application" = "Fechar aplicação";
"Open application settings" = "Abrir definições da aplicação";
"Open dashboard" = "Abrir o painel";
"No notifications available in this module" = "Não existem notificações disponíveis neste módulo."; // translategemma:4b
"Open Calendar" = "Abrir Calendário"; // translategemma:4b
"Toggle the module" = "Ativar/Desativar o módulo"; // translategemma:4b

// Application settings
"Update application" = "Atualizar a aplicação";
"Check for updates" = "Procurar por atualizações";
"At start" = "Ao iniciar";
"Once per day" = "Uma vez por dia";
"Once per week" = "Uma vez por semana";
"Once per month" = "Uma vez por mês";
"Never" = "Nunca";
"Check for update" = "Procurar atualização";
"Show icon in dock" = "Mostrar ícone na Dock";
"Start at login" = "Iniciar durante login";
"Build number" = "Número do Build";
"Import settings" = "Configurações de importação"; // translategemma:4b
"Export settings" = "Configurações de exportação"; // translategemma:4b
"Reset settings" = "Restabelecer as definições";
"Pause the Stats" = "Pausar o Stats";
"Resume the Stats" = "Resumir o Stats";
"Combined modules" = "Módulos combinados";
"Combined details" = "Detalhes combinados"; // translategemma:4b
"Spacing" = "Espaçamento";
"Share anonymous telemetry" = "Partilhar dados de telemetria anónimos"; // translategemma:4b
"Choose file" = "Escolher ficheiro"; // translategemma:4b
"Stress tests" = "Testes de stress"; // translategemma:4b

// Dashboard
"Serial number" = "Número de série";
"Model identifier" = "Identificador do modelo"; // translategemma:4b
"Production year" = "Ano de produção"; // translategemma:4b
"Uptime" = "Tempo de atividade";
"Number of cores" = "%0 cores";
"Number of threads" = "%0 threads";
"Number of e-cores" = "%0 eficiência núcleos"; // translategemma:4b
"Number of p-cores" = "%0 núcleos de desempenho"; // translategemma:4b
"Disks" = "Discos"; // translategemma:4b
"Display" = "Exibição"; // translategemma:4b

// Update
"The latest version of Stats installed" = "A versão mais recente do Stats instalada";
"Downloading..." = "Descarregando...";
"Current version: " = "Versão atual: ";
"Latest version: " = "Última versão: ";

// Widgets
"Color" = "Cor";
"Label" = "Rótulo";
"Box" = "Caixa";
"Frame" = "Quadro";
"Value" = "Valor";
"Colorize" = "Colorir";
"Colorize value" = "Valor da colorização";
"Additional information" = "Informação adicional";
"Reverse values order" = "Ordem inversa dos valores";
"Base" = "Base";
"Display mode" = "Modo de exibição";
"One row" = "Uma linha";
"Two rows" = "Duas linhas";
"Mini widget" = "Mini widget";
"Line chart widget" = "Widget de gráfico linear";
"Bar chart widget" = "Widget de gráfico de barras";
"Pie chart widget" = "Widget de gráfico de setores";
"Network chart widget" = "Widget de gráfico de rede";
"Speed widget" = "Widget de velocidade";
"Battery widget" = "Widget de bateria";
"Stack widget" = "Pilha"; // translategemma:4b
"Memory widget" = "Widget de memória";
"Static width" = "Largura estática";
"Tachometer widget" = "Widget de tacómetro";
"State widget" = "Widget de estados";
"Text widget" = "Widget de texto"; // translategemma:4b
"Battery details widget" = "Widget de detalhes da bateria"; // translategemma:4b
"Show symbols" = "Mostrar simbolos";
"Label widget" = "Widget de etiquetas";
"Number of reads in the chart" = "Número de leituras no gráfico";
"Color of download" = "Cor do download";
"Color of upload" = "Cor do upload";
"Monospaced font" = "Fonte monoespaçada"; // translategemma:4b
"Reverse order" = "Ordem inversa"; // translategemma:4b
"Chart history" = "Histórico do gráfico"; // translategemma:4b
"Default color" = "Padrão"; // translategemma:4b
"Transparent when no activity" = "Transparente quando não há atividade"; // translategemma:4b
"Constant color" = "Constante"; // translategemma:4b

// Module Kit
"Open module settings" = "Abrir definições do módulo";
"Select widget" = "Selecionar widget %0";
"Open widget settings" = "Abrir definições do widget";
"Update interval" = "Intervalo de atualização";
"Usage history" = "Historial de utilização";
"Details" = "Detalhes";
"Top processes" = "Processos principais";
"Pictogram" = "Pictograma";
"Module" = "Módulo";
"Widgets" = "Widgets";
"Popup" = "Aparecer";
"Notifications" = "Notificações";
"Merge widgets" = "Agrupar widgets";
"No available widgets to configure" = "Não foram encontrados widgets para configurar";
"No options to configure for the popup in this module" = "Não foram encontradas opções para configurar para o popup deste módulo";
"Process" = "Processo"; // translategemma:4b
"Kill process" = "Terminar processo"; // translategemma:4b
"Keyboard shortcut" = "Atalho de teclado"; // translategemma:4b
"Listening..." = "A ouvir…"; // translategemma:4b

// Modules
"Number of top processes" = "Número de processos principais";
"Update interval for top processes" = "Intervalo de atualização para os processos principais";
"Notification level" = "Nível de notificação";
"Chart color" = "Cor do gráfico";
"Main chart scaling" = "Escala principal do gráfico"; // translategemma:4b
"Scale value" = "Valor da escala"; // translategemma:4b
"Text widget value" = "Valor do widget de texto"; // translategemma:4b

// CPU
"CPU usage" = "Utilização do CPU";
"CPU temperature" = "Temperatura do CPU";
"CPU frequency" = "Frequência do CPU";
"System" = "Sistema";
"User" = "Utilizador";
"Idle" = "Parado";
"Show usage per core" = "Mostrar uso por núcleo";
"Show hyper-threading cores" = "Mostrar núcleos hyper-threading";
"Split the value (System/User)" = "Dividir o valor (Sistema/Utilizador)";
"Scheduler limit" = "Limite do scheduler";
"Speed limit" = "Limite de velocidade";
"Average load" = "Carga média";
"1 minute" = "1 minuto";
"5 minutes" = "5 minutos";
"15 minutes" = "15 minutos";
"CPU usage threshold" = "Limite de uso da CPU";
"CPU usage is" = "Utilização da CPU é %0";
"Efficiency cores" = "Núcleos de eficiência"; // translategemma:4b
"Performance cores" = "Núcleos de desempenho"; // translategemma:4b
"System color" = "Cor do sistema";
"User color" = "Cor do user";
"Idle color" = "Cor em idle";
"Cluster grouping" = "Agrupamento de cluster";
"Efficiency cores color" = "Núcleos de eficiência, cores"; // translategemma:4b
"Performance cores color" = "Cores dos núcleos de desempenho"; // translategemma:4b
"Total load" = "Carga total"; // translategemma:4b
"System load" = "Carga do sistema"; // translategemma:4b
"User load" = "Carga de utilizadores"; // translategemma:4b
"Efficiency cores load" = "Cores de eficiência carregadas"; // translategemma:4b
"Performance cores load" = "Carga dos núcleos de desempenho"; // translategemma:4b
"All cores" = "Todas as cores"; // translategemma:4b

// GPU
"GPU to show" = "GPU para mostrar";
"Show GPU type" = "Mostrar tipo de GPU";
"GPU enabled" = "GPU ativado";
"GPU disabled" = "GPU desativado";
"GPU temperature" = "Temperatura da GPU";
"GPU utilization" = "Utilização da GPU";
"Vendor" = "Vendedor";
"Model" = "Modelo";
"Status" = "Estado";
"Active" = "Ativo";
"Non active" = "Não ativo";
"Fan speed" = "Velocidade das ventoinhas";
"Core clock" = "Frequência base"; // translategemma:4b
"Memory clock" = "Clock de memória"; // translategemma:4b
"Utilization" = "Utilização";
"Render utilization" = "Utilização da renderização"; // translategemma:4b
"Tiler utilization" = "Utilização de azulejistas"; // translategemma:4b
"GPU usage threshold" = "Limite de uso da GPU";
"GPU usage is" = "Utilização da GPU é %0";

// RAM
"Memory usage" = "Memória utilizada";
"Memory pressure" = "Pressão da memória";
"Total" = "Total";
"Used" = "Utilizado";
"App" = "Aplicação"; // translategemma:4b
"Wired" = "Por fio";
"Compressed" = "Comprimido";
"Free" = "Livre";
"Swap" = "Swap";
"Split the value (App/Wired/Compressed)" = "Divida o valor (App/Por fio/Comprimido)";
"RAM utilization threshold" = "Limite de uso da RAM";
"RAM utilization is" = "Utilização da RAM é %0";
"App color" = "Cor da app";
"Wired color" = "Cor por fio";
"Compressed color" = "Cor comprimida";
"Free color" = "Cor grátis";
"Free memory (less than)" = "Memória livre (menos de)"; // translategemma:4b
"Swap size" = "Tamanho do espaço de troca"; // translategemma:4b
"Free RAM is" = "A RAM disponível é %0"; // translategemma:4b

// Disk
"Show removable disks" = "Mostrar discos removíveis";
"Used disk memory" = "Utilizado %0 de %1";
"Free disk memory" = "Livre %0 de %1";
"Disk to show" = "Disco para mostrar";
"Open disk" = "Disco aberto";
"Switch view" = "Mudar de vista";
"Disk utilization threshold" = "Limite de uso do disco";
"Disk utilization is" = "Utilização do disco é %0";
"Read color" = "Identificar a cor"; // translategemma:4b
"Write color" = "Escreva a cor"; // translategemma:4b
"Disk usage" = "Utilização do disco"; // translategemma:4b
"Total read" = "Total lido"; // translategemma:4b
"Total written" = "Total escrito"; // translategemma:4b
"Write speed" = "Escreva"; // translategemma:4b
"Read speed" = "Leia"; // translategemma:4b
"Drives" = "Unidades de armazenamento"; // translategemma:4b
"SMART data" = "Dados SMART"; // translategemma:4b

// Sensors
"Temperature unit" = "Unidade de temperatura";
"Celsius" = "Celsius";
"Fahrenheit" = "Fahrenheit";
"Save the fan speed" = "Guardar a velocidade da ventoinha";
"Fan" = "Ventoinha";
"HID sensors" = "Sensores HID";
"Synchronize fan's control" = "Sincronizar controlo das ventoinhas";
"Current" = "Atual";
"Energy" = "Energia";
"Show unknown sensors" = "Mostrar sensores desconhecidos";
"Install fan helper" = "Instalar auxiliar das ventoinhas";
"Uninstall fan helper" = "Desinstalar auxiliar das ventoinhas";
"Fan value" = "Valor da ventoinha";
"Turn off fan" = "Desligue o ventilador"; // translategemma:4b
"You are going to turn off the fan. This is not recommended action that can damage your mac, are you sure you want to do that?" = "Você está prestes a desligar o ventilador. Esta é uma ação não recomendada que pode danificar o seu Mac. Tem certeza de que deseja fazê-lo?"; // translategemma:4b
"Sensor threshold" = "Limite do sensor"; // translategemma:4b
"Left fan" = "Esquerdo"; // translategemma:4b
"Right fan" = "Certo"; // translategemma:4b
"Fastest fan" = "Mais rápido"; // translategemma:4b
"Sensor to show" = "Sensor para exibir"; // translategemma:4b

// Network
"Uploading" = "Enviando";
"Downloading" = "Descarregando";
"Public IP" = "IP Público";
"Local IP" = "IP Local";
"Interface" = "Interface";
"Physical address" = "Endereço físico";
"Refresh" = "Atualizar";
"Click to copy public IP address" = "Clica para copiar o endereço de IP público";
"Click to copy local IP address" = "Clica para copiar o endereço de IP local";
"Click to copy wifi name" = "Clica para copiar o nome do wi-fi";
"Click to copy mac address" = "Clica para copiar o endereço mac";
"No connection" = "Sem conexão";
"Network interface" = "Interface de rede";
"Total download" = "Download total";
"Total upload" = "Upload total";
"Reader type" = "Tipo de leitor";
"Interface based" = "Interface";
"Processes based" = "Processo";
"Reset data usage" = "Limpar dados de uso";
"VPN mode" = "Modo da VPN";
"Standard" = "Padrão"; // translategemma:4b
"Security" = "Segurança";
"Channel" = "Canal";
"Common scale" = "Escala comum";
"Autodetection" = "Auto-deteção";
"Widget activation threshold" = "Limite de ativação do widget";
"Internet connection" = "Conexão à internet";
"Active state color" = "Cor do estado ativo";
"Nonactive state color" = "Cor do estado inativo";
"Connectivity host (ICMP)" = "Host da conexão (ICMP)";
"Leave empty to disable the check" = "Deixar vazio para desativar o check";
"Connectivity history" = "Histórico de conectividade"; // translategemma:4b
"Auto-refresh public IP address" = "Atualização automática do endereço IP público"; // translategemma:4b
"Every hour" = "A cada hora"; // translategemma:4b
"Every 12 hours" = "A cada 12 horas"; // translategemma:4b
"Every 24 hours" = "A cada 24 horas"; // translategemma:4b
"Network activity" = "Atividade de rede"; // translategemma:4b
"Last reset" = "A última reinicialização foi realizada %0 dias/semanas/meses/anos atrás"; // translategemma:4b
"Latency" = "Latência"; // translategemma:4b
"Upload speed" = "Enviar"; // translategemma:4b
"Download speed" = "Baixar"; // translategemma:4b
"Address" = "Endereço"; // translategemma:4b
"WiFi network" = "Rede WiFi"; // translategemma:4b
"Local IP changed" = "O endereço IP local foi alterado"; // translategemma:4b
"Public IP changed" = "O endereço IP público foi alterado."; // translategemma:4b
"Previous IP" = "Endereço IP anterior: %0"; // translategemma:4b
"New IP" = "Novo endereço IP: %0"; // translategemma:4b
"Internet connection lost" = "Conexão com a internet perdida"; // translategemma:4b
"Internet connection established" = "Conexão com a Internet estabelecida"; // translategemma:4b

// Battery
"Level" = "Nível";
"Source" = "Fonte";
"AC Power" = "Energia AC"; // translategemma:4b
"Battery Power" = "Carga da bateria";
"Time" = "Tempo";
"Health" = "Saúde";
"Amperage" = "Amperagem";
"Voltage" = "Voltagem";
"Cycles" = "Número de ciclos";
"Temperature" = "Temperatura";
"Power adapter" = "Adaptador de energia";
"Power" = "Energia";
"Is charging" = "Está a carregar";
"Time to discharge" = "Tempo até descarregar";
"Time to charge" = "Tempo até carregar";
"Calculating" = "Calculando";
"Fully charged" = "Completamente carregado";
"Not connected" = "Não conectado";
"Low level notification" = "Notificação de nível baixo";
"High level notification" = "Notificação de nível alto";
"Low battery" = "Bateria fraca";
"High battery" = "Bateria alta";
"Battery remaining" = "%0% bateria restante";
"Battery remaining to full charge" = "%0% para carga completa";
"Percentage" = "Percentagem";
"Percentage and time" = "Percentagem e tempo";
"Time and percentage" = "Tempo e percentagem";
"Time format" = "Formato de hora";
"Hide additional information when full" = "Ocultar informações adicionais quando estiver carregada";
"Last charge" = "Último carregamento";
"Capacity" = "Capacidade";
"current / maximum / designed" = "atual / máxima / desenhada";
"Low power mode" = "Modo poupança de energia";
"Percentage inside the icon" = "Percentagem dentro do ícone";
"Colorize battery" = "Colorir a bateria"; // translategemma:4b
"Charging current" = "Corrente de carregamento"; // translategemma:4b
"Charging Voltage" = "Tensão de carregamento"; // translategemma:4b
"Charger state inside the battery" = "Estado do carregador dentro da bateria"; // translategemma:4b

// Bluetooth
"Battery to show" = "Mostrar bateria";
"No Bluetooth devices are available" = "Não há dispositivos bluetooth disponíveis";

// Clock
"Time zone" = "Fuso horário"; // translategemma:4b
"Local" = "Local";
"Calendar" = "Calendário"; // translategemma:4b
"Show week numbers" = "Mostrar os números da semana"; // translategemma:4b
"Local time" = "Hora local"; // translategemma:4b
"Add new clock" = "Adicionar novo relógio"; // translategemma:4b
"Delete selected clock" = "Excluir o relógio selecionado"; // translategemma:4b
"Help with datetime format" = "Ajuda com o formato de data e hora"; // translategemma:4b

// Colors
"Based on utilization" = "Baseado na utilização";
"Based on pressure" = "Baseado na pressão";
"Based on cluster" = "Baseado no cluster";
"System accent" = "Sinal do sistema"; // translategemma:4b
"Monochrome accent" = "Acabamento monocromático"; // translategemma:4b
"Clear" = "Claro"; // translategemma:4b
"White" = "Branco";
"Black" = "Preto";
"Gray" = "Cinzento";
"Second gray" = "Cinzento secundário";
"Dark gray" = "Cinzento escuro";
"Light gray" = "Cinzento claro";
"Red" = "Vermelho";
"Second red" = "Vermelho secundário";
"Green" = "Verde";
"Second green" = "Verde secundário";
"Blue" = "Azul";
"Second blue" = "Azul secundário";
"Yellow" = "Amarelo";
"Second yellow" = "Amarelo secundário";
"Orange" = "Laranja";
"Second orange" = "Laranja secundário";
"Purple" = "Roxo";
"Second purple" = "Roxo secundário";
"Brown" = "Castanho";
"Second brown" = "Castanho secundário";
"Cyan" = "Ciano";
"Magenta" = "Magenta";
"Pink" = "Rosa";
"Teal" = "Azul petróleo";
"Indigo" = "Indigo";
